app/controllers/microposts_controller.rb

SELECT * FROM "microposts"
---
  def index
    @microposts = Micropost.all

SELECT * FROM "microposts" WHERE ("microposts"."id" = 1)
---
  def show
    @micropost = Micropost.find(params[:id])

SELECT * FROM "microposts" WHERE ("microposts"."id" = 1)
---
  def edit
    @micropost = Micropost.find(params[:id])

INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES('asdf', 0, '2014-07-03 08:44:21', '2014-07-03 08:44:21')
---
  def create
    @micropost = Micropost.new(params[:micropost])

    respond_to do |format|
      if @micropost.save

SELECT * FROM "microposts" WHERE ("microposts"."id" = 1)
UPDATE "microposts" SET "user_id" = 2, "updated_at" = '2014-07-03 08:44:32' WHERE "id" = 1
---
  def update
    @micropost = Micropost.find(params[:id])

    respond_to do |format|
      if @micropost.update_attributes(params[:micropost])